////Task 4 *(Опционально)
////Напишите программу, которая просит пользователя ввести слово "hello". Если пользователь вводит правильное слово, программа благодарит его и завершает работу. Если вводится неправильное слово, программа продолжает запрашивать ввод, пока не будет введено правильное слово.
////
////Дополнительно: Подсчитайте количество попыток, потребовавшихся для ввода правильного слова, и выведите это количество на экран.
//package homework_08;
//
//import java.util.Scanner;
//
//public class Task_4 {
//    public static void main(String[] args) {
//        System.out.println("Введите слово \"hello\"");
//        Scanner scanner = new Scanner(System.in);
//
//        String input = scanner.nextLine();
//
//        if ("hello".compareTo(input)){
//            System.out.println("Благодарим за корректный ввод");
//        } else {
//            System.out.println("Введите корректно слово \"hello\"");
//        }
//
//        //System.out.println(input);
//
//    }
//}
